Австралия/src/AccumulationRegisters/AccountsPayable/AccountsPayable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsPayable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPayment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPaymentCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.SubcontractorInvoiceReceived</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.ArApAdjustments</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
      <types>DocumentRef.AdditionalExpenses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.PurchaseOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Enums/SettlementsTypes/SettlementsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SettlementsTypes</name>
  <enumValues>
    <name>Debt</name>
  </enumValues>
  <enumValues>
    <name>Advance</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/AccumulationRegisters/AccountsPayable/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	AccountsPayable.LineNumber AS LineNumber,
	|	AccountsPayable.Company AS Company,
	|	AccountsPayable.PresentationCurrency AS PresentationCurrency,
	|	AccountsPayable.Counterparty AS Counterparty,
	|	AccountsPayable.Contract AS Contract,
	|	AccountsPayable.Document AS Document,
	|	AccountsPayable.Order AS Order,
	|	AccountsPayable.SettlementsType AS SettlementsType,
	|	AccountsPayable.Amount AS SumBeforeWrite,
	|	AccountsPayable.Amount AS AmountChange,
	|	AccountsPayable.Amount AS AmountOnWrite,
	|	AccountsPayable.AmountCur AS AmountCurBeforeWrite,
	|	AccountsPayable.AmountCur AS SumCurChange,
	|	AccountsPayable.AmountCur AS SumCurOnWrite
	|INTO RegisterRecordsSuppliersSettlementsChange
	|FROM
	|	AccumulationRegister.AccountsPayable AS AccountsPayable");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsSuppliersSettlementsChange", False);
	
EndProcedure

Function AdvanceBalancesControlQueryText() Export
	
	Return
	"SELECT
	|	RegisterRecordsSuppliersSettlementsChange.LineNumber AS LineNumber,
	|	RegisterRecordsSuppliersSettlementsChange.Company AS CompanyPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.PresentationCurrency AS PresentationCurrencyPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.Counterparty AS CounterpartyPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.Contract AS ContractPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.Contract.SettlementsCurrency AS CurrencyPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.Document AS DocumentPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.Order AS OrderPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.SettlementsType AS CalculationsTypesPresentation,
	|	RegisterRecordsSuppliersSettlementsChange.SumBeforeWrite AS SumBeforeWrite,
	|	RegisterRecordsSuppliersSettlementsChange.AmountOnWrite AS AmountOnWrite,
	|	RegisterRecordsSuppliersSettlementsChange.AmountChange AS AmountChange,
	|	RegisterRecordsSuppliersSettlementsChange.AmountCurBeforeWrite AS AmountCurBeforeWrite,
	|	RegisterRecordsSuppliersSettlementsChange.SumCurOnWrite AS SumCurOnWrite,
	|	RegisterRecordsSuppliersSettlementsChange.SumCurOnWrite - ISNULL(AccountsPayableeBalances.AmountCurBalance, 0) AS AdvanceAmountsReceived,
	|	ISNULL(AccountsPayableeBalances.AmountBalance, 0) AS AmountBalance,
	|	ISNULL(AccountsPayableeBalances.AmountCurBalance, 0) AS AmountCurBalance
	|FROM
	|	RegisterRecordsSuppliersSettlementsChange AS RegisterRecordsSuppliersSettlementsChange
	|		INNER JOIN AccumulationRegister.AccountsPayable.Balance(&ControlTime, ) AS AccountsPayableeBalances
	|		ON RegisterRecordsSuppliersSettlementsChange.Company = AccountsPayableeBalances.Company
	|			AND RegisterRecordsSuppliersSettlementsChange.PresentationCurrency = AccountsPayableeBalances.PresentationCurrency
	|			AND RegisterRecordsSuppliersSettlementsChange.Counterparty = AccountsPayableeBalances.Counterparty
	|			AND RegisterRecordsSuppliersSettlementsChange.Contract = AccountsPayableeBalances.Contract
	|			AND RegisterRecordsSuppliersSettlementsChange.Document = AccountsPayableeBalances.Document
	|			AND RegisterRecordsSuppliersSettlementsChange.Order = AccountsPayableeBalances.Order
	|			AND RegisterRecordsSuppliersSettlementsChange.SettlementsType = AccountsPayableeBalances.SettlementsType
	|			AND RegisterRecordsSuppliersSettlementsChange.SettlementsType = VALUE(Enum.SettlementsTypes.Advance)
	|			AND	ISNULL(AccountsPayableeBalances.AmountCurBalance, 0) > 0
	|
	|ORDER BY
	|	LineNumber";
	
EndFunction

#Region InfobaseUpdate

Procedure CheckAndCorrectAmountsForPayment() Export
	
	DefaultLanguageCode = CommonClientServer.DefaultLanguageCode();
	
	Query = New Query;
	Query.Text =
	"SELECT DISTINCT
	|	AccountsPayable.Recorder AS Ref
	|FROM
	|	AccumulationRegister.AccountsPayable AS AccountsPayable
	|WHERE
	|	AccountsPayable.Recorder REFS Document.SupplierInvoice
	|
	|GROUP BY
	|	AccountsPayable.Recorder
	|
	|HAVING
	|	(SUM(AccountsPayable.Amount - AccountsPayable.AmountForPayment) <> 0
	|		OR SUM(AccountsPayable.AmountCur - AccountsPayable.AmountForPaymentCur) <> 0)";
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		
		DocumentObject = Selection.Ref.GetObject();
		If DocumentObject = Undefined Then
			Continue;
		EndIf;
		
		AdditionalProperties = DocumentObject.AdditionalProperties;
		RegisterRecords = DocumentObject.RegisterRecords;
		
		BeginTransaction();
		
		DriveServer.InitializeAdditionalPropertiesForPosting(Selection.Ref, AdditionalProperties);
		Documents.SupplierInvoice.InitializeDocumentData(Selection.Ref, AdditionalProperties);
		DriveServer.ReflectAccountsPayable(AdditionalProperties, DocumentObject.RegisterRecords, False);
		
		Try
			
			InfobaseUpdate.WriteRecordSet(RegisterRecords.AccountsPayable);
			AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
			
			CommitTransaction();
			
		Except
			
			RollbackTransaction();
			
			ErrorDescription = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = 'Error while saving record set %1: %2.'; ru = 'Ошибка при записи набора записей %1: %2.';pl = 'Błąd podczas zapisywania zestawu wpisów %1: %2.';es_ES = 'Error al guardar el conjunto de registros %1: %2.';es_CO = 'Error al guardar el conjunto de registros %1: %2.';tr = '%1 kayıt kümesi kaydedilirken hata oluştu: %2.';it = 'Si è verificato un errore durante il salvataggio dell''insieme di registrazioni %1: %2.';de = 'Fehler beim Speichern von Satz von Einträgen %1: %2.'", DefaultLanguageCode),
				Selection.Ref,
				BriefErrorDescription(ErrorInfo()));
			
			WriteLogEvent(
				InfobaseUpdate.EventLogEvent(),
				EventLogLevel.Error,
				Metadata.AccumulationRegisters.AccountsPayable,
				,
				ErrorDescription);
			
		EndTry;
		
	EndDo;
	
EndProcedure

#EndRegion

#EndRegion

#EndIf
